Repository: python-dirbtuves/website
Catalog: pylab/locale/*/LC_MESSAGES/django.po
Languages: lt

source: First name
lt: Vardas

source: Last name
lt: Pavardė

source: Email address
lt: El. pašto adresas

source: Will be used for communication. If you want not to get any emails, leave this field empty.
lt: Bus naudojamas komunikacijai. Jei pageidaujate negauti jokių laiškų, palikite šį lauką tuščią.

source: Default
lt: Numatytoji

source: Language
lt: Kalba

source: Login
lt: Prisijungti

source: Enter your <a href="http://openidexplained.com/">OpenID</a> address:
lt: Įveskite savo <a href="http://openidexplained.com/">OpenID</a> adresą:

source: or choose one of available authorization providers:
lt: arba pasirinkite vieną iš prieinamų autorizacijos tiekėjų:

source: Signup
lt: Susikurti paskyrą

source: Finish your registration
lt: Užbaigti registraciją

source: Your registraiton to %(site_name)s almost done. Please fill in form below and then you be able to use %(site_name)s.
lt: Jūsų registracija %(site_name)s tinklapyje beveik baigta. Prašome užpildyti formą, esančią žemiau ir galėsite naudotis %(site_name)s.

source: Submit
lt: Saugoti

source: Settings were saved succesfully.
lt: Nustatymai buvo sėkimingai išsaugoti.

source: Profile settings
lt: Profilio nustatymai

source: Save
lt: Saugoti

source: Lithuanian
lt: Lietuvių

source: English
lt: Anglų

source: Describe your project idea. You can use [Markdown](http://daringfireball.net/projects/markdown/syntax){:target=_blank} markup.
lt: Apibūdinkite savo projekto idėją. Galite naudoti [Žymėjimų kalbą](http://daringfireball.net/projects/markdown/syntax){:target=_blank}.

source: Summer Python Workshop
lt: Vasaros Python dirbtuvės

source: Title
lt: Pavadinimas

source: Description
lt: Aprašymas

source: Logout
lt: Atsijungti

source: Change
lt: Redaguoti

source: Suggest new project idea
lt: Pasiūlyti naują projekto idėją

source: Project idea
lt: Projekto idėja

source: No suggested projects yet.
lt: Kol kas nėra pasiūlytų projektų.

source: Project „%s“ created.
lt: Projektas „%s“ sukurtas.

source: Suggest new project
lt: Pasiūlyti naują projektą

source: Project „%s“ updated.
lt: Projektas „%s“ atnaujintas.

source: About
lt: Apie

source: About Summer Python Workshop
lt: Apie Vasaros Python dirbtuves

source: During this event everybody can learn how to program in Python and Django by creating <a href="http://pylab.lt">pylab.lt</a> website.
lt: Šio renginio metu visi norintys gali mokytis programuoti su Python ir Django, kurdami <a href="http://pylab.lt">pylab.lt</a> svetainę.

source: Every workshop participant has to choose individual task, which he would be able to complete in one week. Two hours long meeting is held each week, during which participants present how they managed to complete their tasks and what issues they faced. Advanced programmers give advices and help to solve problems during this meeting. Participants can choose next tasks if they managed to finish their task successfully.
lt: Kiekvienas dirbtuvių dalyvis turi pasirinkti individualią užduotį, kurią atliktų per savaitę. Kiekvieną savaitę vyksta 2 valandų susitikimas, per kurį dalyviai pristato, kaip įgyvendino savo užduotis, ar su kokiais sunkumais susidūrė. Šio susitikimo metu patyrę programuotojai pataria bei padeda išspręsti kilusias problemas. Sėkmingai užduotį įgyvendinę dalyviai pasirenka sekančios savaitės užduotis.

source: "Summer Python workshop" meetings are held every Monday from 18:00 till 20:00 at Čiurlionio g. 13-1.
lt: „Vasaros Python dirbtuvių“ susitikimas vyksta kiekvieną pirmadienį nuo 18:00 iki 20:00, Čiurlionio g. 13-1.

source: Python workshops policy
lt: Python dirbtuvių politika

source: Intellectual property and source code created during Python workshops by participants belong to Python workshops.
lt: Python dirbtuvių metu padarytų dalyvių intelektualinių ir programinio kodo įnašų autorinės teisės priklauso Python dirbtuvėms.

source: Python workshop's strategical and financial solutions are made democratically: Python workshops participants vote and majority's will is executed.
lt: Python dirbtuvių strateginiai ir finansiniai sprendimai priimami demokratiškai: balsuojant Python dirbtuvių dalyviams ir vykdant daugumos valią.

source: Each Python workshops participant has to:
lt: Python dirbtuvių dalyviai turi:

source: Accept open source and open knowledge ideologies.
lt: Pritarti atviro kodo ir atvirų žinių ideologijoms.

source: Respect and protect human rights and liberties. Especially right for privacy.
lt: Gerbti ir saugoti žmonių teises ir laisves. Ypač teisę į privatumą.

source: Python workshops participants can suggest ideas, which could be implemented during Python workshops.
lt: Python dirbtuvių dalyviai gali siūlyti idėjas, kurias būtų galima realizuoti Python dirbtuvių metu.

source: Good quality open source code is created during Python workshops, hence projects are released under open source licences, unless Python workshops community decide otherwise.
lt: Python dirbtuvių metu mokomasi kurti kokybišką atvirą kodą, todėl projektų išeities kodas pateikiamas su atviro kodo licencija, jeigu Python dirbtuvių dalyviai nenusprendžia kitaip.

source: Income from Python workshops projects has to be allocated only for Python workshops community's prosper. For example, expenses for domains, servers, rent, municipality or hackathon organization can be covered, also permanent employees for Python workshops can be employed.
lt: Iš Python dirbtuvių projektų surinktos lėšos skiriamos Python dirbtuvių bendruomenei puoselėti. Pavyzdžiui, gali būti padengiamos projektų domenų, serverių, patalpų nuomos, komunalinių mokesčių, hakatonų organizavimo sąnaudos, taip pat gali būti samdomi etatiniai Python dirbtuvių programuotojai.
